 IDENTIFICATION DIVISION.
       PROGRAM-ID. PARRAFOS.
       DATA DIVISION.
        FILE SECTION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
      PARRAFO1.
      DISPLAY " ESTE ES EL PRIMER PARRAFO".
      PERFORM PARRAFO3.
      PARRAFO2.
      DISPLAY"ESTE ES EL SEGUNDO PARRAFO".
      PERFORM PARRAFO4.
      PARRAFO3.
      DISPLAY"ESTE ES EL TERCER PARRAFO".
      PERFORM PARRAFO2.
      PARRAFO4.
      DISPLAY "ESTE ES EL CUARTO PARRAFO".
      DISPLAY"AQUI TERMINA LOS 4 PARRAFOS!".
       
       
       
        STOP RUN.
        END PROGRAM PARRAFOS.
