IDENTIFICATION DIVISION.
PROGRAM-ID. PrimerPrograma.
AUTHOR PablitoQuir.
DATE-WRITTEN.12/01/2023
DATA DIVISION.

FILE SECTION.
    WORKING-STORAGE SECTION.
    01 SALUDO PIC A(22).
    01 TITULO PIC A(40) VALUE "PRIMER PROGRAMA EN LENGUAJE COBOL".
    01 NUMERO PIC 9(1) VALUE 1.
    
    LINKAGE SECTION.
PROCEDURE DIVISION.
   MAIN-PROCEDURE.
   DISPLAY "PRIMER PROGRAMA COBOL".
   MOVE "VIVA COBOL" TO SALUDO.
   DISPLAY "MUY BUENAS , " SALUDO.
   DISPLAY "TITULO: " TITULO.
   DISPLAY "ESTE ES MI PROGRAMA  NUMERO : " NUMERO.
   STOP RUN.
END PROGRAM PrimerPrograma.
